# System Zone Element Type Geometric Definition Property

Source: https://www.revitapidocs.com/2026/390508b5-7a64-cfd2-99a8-5b5b1b62b125.htm

---

| System Zone Element Type Geometric Definition Property |
| --- |

The geometric definition for this element type.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ZoneGeometricDefinition GeometricDefinition { get; }
```

```
Public ReadOnly Property GeometricDefinition As ZoneGeometricDefinition
	Get
```

```
public:
property ZoneGeometricDefinition GeometricDefinition {
	ZoneGeometricDefinition get ();
}
```

```
member GeometricDefinition : ZoneGeometricDefinition with get
```

#### Property Value

ZoneGeometricDefinition See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace